## Übungen zur Lektion 1: Select mit der cia-Datenbank

In [2]:
import pandas as pd
import sqlite3
con = sqlite3.connect('../../data/cia.db')
df = pd.read_sql("SELECT * FROM cia", con)
len(df)

235

## Aufgaben

Aufgabe 1. Gib alle Daten der Tabelle 'cia' aus.

In [ ]:
df

Aufgabe 2: Gib die Namen aller Länder aus.

In [3]:
df['Name'] # ergibt eine Serie

0                     Afghanistan
1                        Albanien
2                        Algerien
3      Amerikanische Samoa-Inseln
4                         Andorra
                  ...
230                     West Bank
231              Westliche Sahara
232                         Jemen
233                        Zambia
234                      Zimbabwe
Name: Name, Length: 235, dtype: object

In [4]:
df[['Name']] # ergibt ein DataFrame

                           Name
0                   Afghanistan
1                      Albanien
2                      Algerien
3    Amerikanische Samoa-Inseln
4                       Andorra
..                          ...
230                   West Bank
231            Westliche Sahara
232                       Jemen
233                      Zambia
234                    Zimbabwe

[235 rows x 1 columns]

Aufgabe 3: Gib alle Länder an, die mehr als 100 Millionen (1E08) Einwohner haben.

In [5]:

df[ df["Einwohner"] > 100E6 ] [["Name","Einwohner"]]

                               Name     Einwohner
17                       Bangladesh  1.291942e+08
28                        Brasilien  1.728604e+08
43                            China  1.261832e+09
98                           Indien  1.014004e+09
99                       Indonesien  2.247842e+08
106                           Japan  1.265500e+08
139                          Mexiko  1.003498e+08
156                         Nigeria  1.233378e+08
162                        Pakistan  1.415538e+08
175                        Russland  1.460012e+08
222  Vereinigte Staaten von Amerika  2.755627e+08

In [6]:
df2 = df[['Name','Einwohner']][ df['Einwohner'] > 1E8 ]
df2.rename(columns={'Name': 'Land'}, inplace=True)  # Spalten umbenennen
df2

                               Land     Einwohner
17                       Bangladesh  1.291942e+08
28                        Brasilien  1.728604e+08
43                            China  1.261832e+09
98                           Indien  1.014004e+09
99                       Indonesien  2.247842e+08
106                           Japan  1.265500e+08
139                          Mexiko  1.003498e+08
156                         Nigeria  1.233378e+08
162                        Pakistan  1.415538e+08
175                        Russland  1.460012e+08
222  Vereinigte Staaten von Amerika  2.755627e+08

In [8]:
df2 = df[['Name','Einwohner']]
df2["Einwohner in Mio"] = (df2["Einwohner"]/1E6).round(2)
df2[["Name","Einwohner in Mio"]] [df2["Einwohner in Mio"] > 100]

/tmp/ipykernel_12974/2169991184.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Einwohner in Mio"] = (df2["Einwohner"]/1E6).round(2)

                               Name  Einwohner in Mio
17                       Bangladesh            129.19
28                        Brasilien            172.86
43                            China           1261.83
98                           Indien           1014.00
99                       Indonesien            224.78
106                           Japan            126.55
139                          Mexiko            100.35
156                         Nigeria            123.34
162                        Pakistan            141.55
175                        Russland            146.00
222  Vereinigte Staaten von Amerika            275.56

Aufgabe 4: Gib die Länder an, die ein Bruttosozialprodukt (BIP) zwischen 1 und 100 Milliarden haben und in Asien liegen.

In [11]:
df['Name'][ df['BIP'].between(1E9,100E9) ]

0         Afghanistan
1            Albanien
4             Andorra
5              Angola
10           Armenien
            ...
228    Virgin Islands
230         West Bank
232             Jemen
233            Zambia
234          Zimbabwe
Name: Name, Length: 130, dtype: object

Aufgabe 5: Gib die Einwohnerzahlen für Frankreich, Deutschland und Polen aus.

In [20]:
df[['Name','Einwohner']][ df['Name'].str.contains('Frankreich|Deutschland|Polen', regex=True) ]

            Name   Einwohner
72    Frankreich  59329691.0
79   Deutschland  82797408.0
170        Polen  38646023.0

Aufgabe 6. Zeige Name und Einwohnerzahl in Millionen für die Länder Südamerikas.

In [59]:
df['Einwohner in Mio'] = (df['Einwohner']/1E6).round(2) # neue Spalte wird erzeugt
df[['Name', 'Einwohner in Mio']] [ df['Region'] == 'Südamerika' ]

                                  Name  Einwohner in Mio
9                          Argentinien             36.96
25                            Bolivien              8.15
28                           Brasilien            172.86
42                               Chile             15.15
46                           Kolumbien             39.69
61                             Ecuador             12.92
68   Falkland Islands (Islas Malvinas)              0.00
73                 Französisch-Guayana              0.17
91                              Guyana              0.70
166                           Paraguay              5.59
167                               Peru             27.01
199                           Suriname              0.43
223                            Uruguay              3.33
226                          Venezuela             23.54

Aufgabe 7. Gib die Namen und das pro Kopf-Jahreseinkommen der Länder mit mehr als 200 Millionen Einwohnern aus.

In [60]:
df['pro Kopf-Jahreseinkommen'] = (df['BIP']/df['Einwohner']).round(2) # neue Spalte erzeugt
df[['Name','pro Kopf-Jahreseinkommen']] [ df['Einwohner'] > 200E6 ]

                               Name  pro Kopf-Jahreseinkommen
43                            China                   3803.99
98                           Indien                   1780.07
99                       Indonesien                   2713.71
222  Vereinigte Staaten von Amerika                  33585.83

Aufgabe 8. Wie vorherige Aufgabe, allerdings sollen die Ergebnisse absteigend nach dem pro Kopf Jahreseinkommen sortiert werden.

In [61]:
df[['Name','pro Kopf-Jahreseinkommen']] [ df['Einwohner'] > 200E6 ].sort_values(by='pro Kopf-Jahreseinkommen')

                               Name  pro Kopf-Jahreseinkommen
98                           Indien                   1780.07
99                       Indonesien                   2713.71
43                            China                   3803.99
222  Vereinigte Staaten von Amerika                  33585.83

Aufgabe 9. In welchen Ländernamen kommt das Wort 'Vereinigte' vor?

In [63]:
df[ df['Name'].str.contains("Vereinigte", regex=True) ]

,LID,Name,Region,Flaeche,Einwohner,BIP,Einwohner in Mio,pro Kopf-Jahreseinkommen
220,221,Vereinigte Arabische Emirate,Mittlerer Osten,82880,2369153.0,4.150000e+10,2.37,17516.81
222,223,Vereinigte Staaten von Amerika,Nordamerika,9629091,275562673.0,9.255000e+12,275.56,33585.83

Aufgabe 10. Lasse Dir in alphabetischer Reihenfolge alle verschiedenen Regionen anzeigen.

In [ ]:
df1 = df['Region']
df2 = pd.unique(df1)
df2.sort()
df2

Aufgabe 11. Zeige alle Länder, bei denen das Bruttoinlandsprodukt unbekannt ist.

In [ ]:
df[['Name', 'BIP']]